params_cfg = {
            # 相机内参
            "CameraMatrix": [[
                2420.243147971212,
                0.0,
                926.2781198967485
            ],
            [
                0.0,
                2419.409329587678,
                621.1637122932556
            ],
            [
                0.0,
                0.0,
                1.0
            ]],

            # 手眼标定外参变换矩阵
            "CalibMatrix": [[
                -0.9978857724546628,
                0.005262987507543082,
                0.06477874724827706,
                -83.83433716077445
            ],
            [
                0.0033374285819437314,
                0.9995503823843812,
                -0.02979756106961544,
                -881.8247842341067
            ],
            [
                -0.06490644577406116,
                -0.029518367802649284,
                -0.9974546702779261,
                1737.9211371593863
            ],
            [
                0.0,
                0.0,
                0.0,
                1.0
            ]],

            # 机械臂IP
            "robot_ip": "10.109.40.63",
            "mech_ip": "10.109.40.68",

            # 起始拍照点时机械臂的位姿 [x,y,z,rx,ry,rz] unit: m, angle
            "homePose": [0.006219003130980189, -0.39757270615087265, 0.5599120108393485, 178.03474356469798, 0.03564292742256733, 90.81348963666778],
            "homePoseJoint": [-59.49914913366338, 33.3641707920792, 128.20790289256198, 5.715578589108912, 91.71441831683167, -60.165686881188115],

            # 放置点的机械臂位姿 [x,y,z,rx,ry,rz] unit: m, angle
            "placePose": [0.006224921836183054, -0.35052873270728474, 0.42861010406136263, -179.73753950270856, -0.008855750469527622, 178.7941583784951],
            "placePoseJoint": [-54.204285272277225, 37.57766089108911, 142.33522727272728, 14.824798886138614, 89.87685643564357, -142.88838180693068],

            # 物体提起到的位置点 [x,y,z,rx,ry,rz] unit: m, angle
            "liftPose": [0.003641100163481745, -0.7581416378073874, 0.49947188144919213, 178.03706504666417, 0.03524930951384048, 90.8135200896591],
            "liftPoseJoint": [-74.761989480198, -6.057008044554456, 104.77640754132233, 21.22439665841584, 91.79726175742573, -75.43401918316832],

            # 物体提起到的位置点 [x,y,z,rx,ry,rz] unit: m, angle
            "seliftPose": [-0.029283816476313437, -0.9177811781852399, 0.7450731361542327, 178.49596535643977, -2.361663213860385, 105.8169482496486],
            "seliftPoseJoint": [-79.45939047029704, -18.208152846534652, 65.44272985537191, -8.971766707920793, 91.1490563118812, -95.09057858910892],


            # 是否采用GPU
            "device": "cuda:0", # "cuda:0"

            # 2D像素坐标中有效工作区域范围[x,y],用于设定碰撞检测区域的点云 unit: pixel
            "top_left": [523, 328],
            "bottom_right": [1520, 1010],

            # 2D像素坐标中安全工作区域范围[x,y]，用于生成安全区域内的抓取姿态 unit: pixel
            "region_left": [702, 478],
            "region_right": [1334, 831],

            # 抓取姿态的最大倾斜角度，高于该直被过滤掉
            "coneAngle": 40.0, # 30  35
            "max_angle_deg": 70.0, # 45.0
            "upper_ratio": 0.80,
            # 生成局部点云下采样的最近邻个数
            "num_neighbors": 30, 
            # 生成局部点云下采样的size
            "voxel_size": 0.0002,
            # 碰撞检测的场景点云下采样的size
            "collision_voxel_size": 0.005, # 0.005 
            # 碰撞检测的阈值，阈值越大生成的抓取姿态越多，但会导致更多的碰撞可能性
            "collision_thresh": 0.005,

            # 夹爪的长度 unit: mm
            "gripper_lens_list": [372,336.37,352.0,354.0,335.17, 337.5, 357.5, 282],
            "gripper_lens": 279, # 260.5, 280
            # 安装在末端的夹爪与机械臂末端存在的旋转角度直，用于减少误差
            "gripper_angle": -90,
            # 在抓取物体之前将机械臂末端沿着抓取方向后退的距离 unit: mm
            "gripper_forward_move": 50, # 50

            # 相机深度的缩放因子
            "factor_depth": 1000.0,
            # 深度图预处理
            "use_depth_proce":False,
            "depth_radius": 3,

            # 检测阈值
            "detect_conf":0.25,
            # skip 检测个数
            "skip_detect_num":10, # 4  8

            # checkpoint file path
            "obb_checkpoint": "./weights/yolov8s_obb_crossbeam_region_156.pt",
            "seg_checkpoint": './weights/yolov8s_seg_crossbeam_region.pt', 

            # SAM model params
            "use_sam": False,  # True, False
            "sam_checkpoint": "./weights/sam_vit_l_0b3195.pth",  # "weights/sam_vit_h_4b8939.pth",
            "model_type": "vit_l",  # "vit_h",

            # 将检测结果存放到指定的文件夹中
            "root_dir": "./tmp_imgs",
            
            # mask file path
            "workspace_mask_path": "conf/workspace_mask.png",

            "ratio_major": 0.80, # 0.75
            "ratio_minor": 0.75, # 0.45 0.70 0.75
        }
